﻿﻿//****************************************************************************
//****************************************************************************
//**                                                                        **
//**            (C)Copyright 1993-2017 Supermicro Computer, Inc.            **
//**                                                                        **
//****************************************************************************
//****************************************************************************
//
//  File History
//
//  Rev. 1.00
//    Bug Fix : N/A.
//    Reason  : Based on Purley_Setup_Mapping_Language_Draft_20170301_Joe.xlsx 
//              and Official_BIOS_SOP_Revised_Draft_20170301_Mapping_Language_Joe.xlsx 
//              to implement HII mapping language for BIOS setting preservation.
//    Auditor : Joe Jhang
//    Date    : Mar/02/2017
//
//****************************************************************************
//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2014, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************

//**********************************************************************
// $Header: $
//
// $Revision: $
//
// $Date: $
//**********************************************************************
// Revision History
// ----------------
// $Log: $
// 
// 
//**********************************************************************
//<AMI_FHDR_START>
//
// Name: NetworkStackSetupScreen.UNI
//
// Description: String definitions for network Template
//
//<AMI_FHDR_END>
//**********************************************************************

/=#
#langdef   eng   "English"    // English
#langdef   x-AMI "x-AMI"      // AMI Configuration Language

#string STR_NETWORK_STACK_ENABLE        #language eng   "Network Stack"
                                        #language x-AMI "COMMN014" //SMCPKG_SUPPORT
#string STR_NETWORK_STACK_HELP          #language eng   "Enable/Disable UEFI Network Stack"
#string STR_STACK_FORM                  #language eng   "Network Stack Configuration"
#string STR_STACK_FORM_HELP             #language eng   "Network Stack Settings"
#string STR_IPV4_PXE_ENABLE             #language eng   "Ipv4 PXE Support"
                                        #language x-AMI "COMMN015" //SMCPKG_SUPPORT
#string STR_IPV4_PXE_HELP               #language eng   "Enable Ipv4 PXE Boot Support. If disabled IPV4 PXE boot option will not be created"
#string STR_IPV6_PXE_ENABLE             #language eng   "Ipv6 PXE Support"
                                        #language x-AMI "COMMN017" //SMCPKG_SUPPORT
#string STR_IPV6_PXE_HELP               #language eng   "Enable Ipv6 PXE Boot Support. If disabled IPV6 PXE boot option will not be created"

#string STR_IPSEC_CERTIFICATE_ENABLE    #language eng   "IPSEC Certificate"
                                        #language x-AMI "NWSK003"
#string STR_IPSEC_CERTIFICATE_HELP      #language eng   "Support to Enable/Disable IPSEC certificate for Ikev."

#string STR_PXE_BOOT_WAIT_TIME          #language eng   "PXE boot wait time"
                                        #language x-AMI "COMMN019" //SMCPKG_SUPPORT
#string STR_PXE_BOOT_WAIT_TIME_HELP     #language eng   "Wait time to press ESC key to abort the PXE boot"

#string STR_MEDIA_DETECT_COUNT             #language eng   "Media detect count"
                                           #language x-AMI "COMMN01A" //SMCPKG_SUPPORT
#string STR_MEDIA_DETECT_COUNT_HELP        #language eng  "Number of times presence of media will be checked"

#string STR_IPV4_HTTP_ENABLE            #language eng   "Ipv4 HTTP Support"
                                        #language x-AMI "COMMN016" //SMCPKG_SUPPORT
#string STR_IPV4_HTTP_HELP              #language eng   "Enable Ipv4 HTTP Boot Support. If disabled IPV4 HTTP boot option will not be created"

#string STR_IPV6_HTTP_ENABLE            #language eng   "Ipv6 HTTP Support"
                                        #language x-AMI "COMMN018" //SMCPKG_SUPPORT
#string STR_IPV6_HTTP_HELP              #language eng   "Enable Ipv6 HTTP Boot Support. If disabled IPV6 HTTP boot option will not be created"

//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2014, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**         5555 Oakbrook Pkwy, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************